<script setup lang="ts">
import type { ArticleCard } from '~/types/article.models'

// SEO настройки
const name = useSiteName()
useSeoMeta({
  title: `${name} – Статьи`,
  description: `${name} — IT компания по разработке сайтов и мобильных приложений`,
})
defineOgImageComponent('main', {
  title: `${name} – Статьи 📖`,
})

const articles: ArticleCard[] = [
  {
    id: 1,
    created: '1.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 2,
    created: '2.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 3,
    created: '3.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'easy',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 4,
    created: '4.08.2024',
    time: 18,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'hard',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 5,
    created: '5.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 6,
    created: '6.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 7,
    created: '7.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'easy',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 8,
    created: '8.08.2024',
    time: 18,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'hard',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 9,
    created: '9.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 10,
    created: '10.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 11,
    created: '11.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'easy',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 12,
    created: '12.08.2024',
    time: 18,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'hard',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 13,
    created: '13.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 14,
    created: '14.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'medium',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 15,
    created: '15.08.2024',
    time: 8,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'easy',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
  {
    id: 16,
    created: '16.08.2024',
    time: 18,
    title: 'Как создать успешный веб-сайт: советы от профессионалов',
    image: '/images/mock/services/site/banner.jpg',
    seo_url: 'kak-sozdat-uspeshnyj-veb-sajt-sovety-ot-professionalov',
    complexity: 'hard',
    description: `В современном цифровом мире веб-сайт является лицом вашего бизнеса. 
    Создание успешного веб-сайта требует внимательного планирования и учета множества аспектов. 
    В этой статье мы поделимся некоторыми 
    ключевыми советами, которые помогут вам создать сайт, который будет не только красивым, но и функциональным.`,
  },
]
</script>

<template>
  <div>
    <nuxt-layout name="main">
      <div class="container">
        <article-list :articles="articles" :page-size="8">
          <ui-h1>Статьи</ui-h1>
        </article-list>
      </div>
    </nuxt-layout>
  </div>
</template>

<style scoped lang="scss"></style>
